[
    {
        "title":"Laptop คืออะไร",
        "subtitle":"คอมพิวเตอร์คืออุปกรณ์ที่ใช้สำหรับการคำนวณและทำงานอื่นๆ",
        "image_url":"https://raw.githubusercontent.com/petnorkaun/basicAPI/main/monitor.jpg",
        "detail":"อุปกรณ์อิเล็กทรอนิกส์ หรือเครื่องคำนวณอิเล็กทรอนิกส์ที่ทำงานภายใต้ชุดคำสั่ง เมื่ออุปกรณ์ทำงานตามชุดคำสั่ง คอมพิวเตอร์ก็สามารถทำงานได้อย่างสมบูรณ์แบบ ซึ่งใช้คอมพิวเตอร์สำหรับการทำงานตามที่ผู้ใช้ต้องการ หรือใช้คอมพิวเตอร์แก้ปัญหาเรื่องต่าง ๆ ทั้งที่ง่าย และซับซ้อนได้ ด้วยการประมวลผลอย่างรวดเร็ว"
    },
    {
        "title":"มาเขียนโปรแกรมกัน",
        "subtitle":"บทความการเขียนโปรแกรม",
        "image_url":"https://raw.githubusercontent.com/petnorkaun/basicAPI/main/code.jpg",
        "detail":"การเขียนโปรแกรมคอมพิวเตอร์ (อังกฤษ: Computer programming) หรือเรียกให้สั้นลงว่า การเขียนโปรแกรม (อังกฤษ: Programming) หรือ การเขียนโค้ด (Coding) เป็นขั้นตอนการเขียน ทดสอบ และดูแลซอร์สโค้ดของโปรแกรมคอมพิวเตอร์ ซึ่งซอร์สโค้ดนั้นจะเขียนด้วยภาษาโปรแกรม ขั้นตอนการเขียนโปรแกรมต้องการความรู้ในหลายด้านด้วยกัน เกี่ยวกับโปรแกรมที่ต้องการจะเขียน และขั้นตอนวิธีที่จะใช้ ซึ่งในวิศวกรรมซอฟต์แวร์นั้น การเขียนโปรแกรมถือเป็นเพียงขั้นหนึ่งในวงจรชีวิตของการพัฒนาซอฟต์แวร์"
    },
    {
        "title":"Flutter คืออะไร",
        "subtitle":"Tools สำหรีบออกแบบ UI",
        "image_url":"https://raw.githubusercontent.com/petnorkaun/basicAPI/main/flutter.jpg",
        "detail":"Flutter is an open-source UI software development kit created by Google. It is used to develop cross platform applications from a single codebase for any web browser,[4] Fuchsia, Android, iOS, Linux, macOS, and Windows.[5] First described in 2015,[6][7] Flutter was released in May 2017"
    },
    {
        "title":"Python คืออะไร",
        "subtitle":"ภาษาเขียนโปแกรมชนิดหนึ่ง",
        "image_url":"https://raw.githubusercontent.com/petnorkaun/basicAPI/main/python.jpg",
        "detail":"ไพทอน (อังกฤษ: Python) เป็นอินเทอร์พรีเตอร์ภาษาระดับสูงซึ่งสร้างโดยคีโด ฟัน โรสซึม โดยเริ่มใน พ.ศ. 2533 การออกแบบของภาษาไพทอนมุ่งเน้นให้ผู้โปรแกรมสามารถอ่านชุดคำสั่งได้โดยง่ายผ่านการใช้งานอักขระเว้นว่าง (whitespaces) จำนวนมาก นอกจากนั้นการออกแบบภาษาไพทอนและการประยุกต์ใช้แนวคิดการเขียนโปรแกรมเชิงวัตถุในตัวภาษายังช่วยให้นักเขียนโปรแกรมสามารถเขียนโปรแกรมที่เป็นระเบียบ อ่านง่าย มีขนาดเล็ก และง่ายต่อการบำรุง"
    }
]


